Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УпаковкиВызовСервера/Ext/Module.bsl
//Получает коэффициент упаковки
//Параметры: Упаковка 
//					Тип("СправочникСсылка.УпаковкиНоменклатуры") или
//                  Тип("СправочникСсылка.КдассификаторЕдиницИзмерения")
//
//Возвращаемое значение: Коэффициент Тип("Число")
//
Функция КоэффициентУпаковки(Упаковка) Экспорт
	
	Коэффициент = 1;
	
	Если Не ТипЗнч(Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
		Возврат Коэффициент; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент = 0
	|			ТОГДА 1
	|		ИНАЧЕ УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|ГДЕ
	|	УпаковкиНоменклатуры.Ссылка = &Упаковка";
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Коэффициент = Выборка.КоэффициентУпаковки;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

//Возвращает единицу измерения номенклатуры
//Параметры: Номенклатура Тип("СправочникСсылка.Номенклатура")
//
//Возвращаемое значение: БазоаяЕдиница Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//                       Наименование Тип("Строка") -необяз.
//
Функция ЕдиницаПоУмолчанию(Номенклатура, Наименование = "") Экспорт
	
	БазоваяЕдиница 	= Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	Наименование 	= "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО Номенклатура.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БазоваяЕдиница = Выборка.ЕдиницаИзмерения;
		Наименование = Выборка.Наименование;
	КонецЕсли;
	
	Возврат БазоваяЕдиница;
	
КонецФункции

//Получает список упаковок номенклатуры и добавляет туда базовую единицу
//Параметры: Номенклатура Тип("СправочникСсылка.Номенклатура")
//
//Возвращаемое значение: СписокЕдиниц Тип("СписокЗначений")
//
Функция ПолучитьСписокЕдиницИзмеренияУпаковок(Номенклатура) Экспорт
	
	СписокЕдиниц = Новый СписокЗначений;
	
	НаименованиеЕдиницыНоменклатуры 	= "";
	ЕдиницаНоменклатуры 				= ЕдиницаПоУмолчанию(Номенклатура, НаименованиеЕдиницыНоменклатуры);
	СписокЕдиниц.Добавить(ЕдиницаНоменклатуры, НаименованиеЕдиницыНоменклатуры);
	
	УпаковкиНоменклатуры = УпаковкиВызовСервера.СписокУпаковокНоменклатуры(Номенклатура);
	Для Каждого ЭлементСписка Из УпаковкиНоменклатуры Цикл 
		СписокЕдиниц.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
	Возврат СписокЕдиниц;
	
КонецФункции

//Получает спсиок упаковок номенклатуры
//Параметры: Номенклатура ТИп("СправочникСсылка.Номенклатура")
//
//Возвращаемое значение: СписокУпаковок Тип("СписокЗначений")
//
Функция СписокУпаковокНоменклатуры(Номенклатура) Экспорт
	
	СписокУпаковок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка КАК Упаковка,
	|	УпаковкиНоменклатуры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|ГДЕ
	|	УпаковкиНоменклатуры.Владелец = &Номенклатура
	|	И НЕ УпаковкиНоменклатуры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	УпаковкиНоменклатуры.Коэффициент
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокУпаковок.Добавить(Выборка.Упаковка, Выборка.Наименование);	
	КонецЦикла;
	
	Возврат СписокУпаковок;
	
КонецФункции

//Проверяет используется ли конкретная упаковка в документах
//или использутся ли упаковки вобще в документах указанного вида
//Параметры: Упаковка Тип("СправочникССылка.УпаковкиНоменклатуры) - необяз.
//
//Возвращаемое значение: Результат Тип("Булево")
//
Функция УпаковкаИспользуетсяВДокументах(Упаковка = Неопределено) Экспорт
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить("ПоступлениеТоваровУслуг");
	МассивДокументов.Добавить("КорректировкаПоступления");
	МассивДокументов.Добавить("ВозвратТоваровПоставщику");
	МассивДокументов.Добавить("РеализацияТоваровУслуг");
	МассивДокументов.Добавить("КорректировкаРеализации");
	МассивДокументов.Добавить("ВозвратТоваровОтПокупателя");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДокументамСУпаковками(МассивДокументов);
	Запрос.УстановитьПараметр("ЕстьУпаковка", ЗначениеЗаполнено(Упаковка));
	Запрос.УстановитьПараметр("Упаковка", ?(ЗначениеЗаполнено(Упаковка), Упаковка, Справочники.УпаковкиНоменклатуры.ПустаяСсылка()));
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Документы КАК Документы
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(втДокументы.Документы) КАК КоличествоДокументов
	|ИЗ
	|	втДокументы КАК втДокументы";
    Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КоличествоДокументов > 0;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//Формирует текст запроса по документам
//Параметры: МассивДокументов Тип("Массив")
//
//Возвращаемое значение: ТекстЗапросаПоДокументам Тип("Строка")
//
Функция ПолучитьТекстЗапросаПоДокументамСУпаковками(МассивДокументов)
	
	ТекстЗапросаПоДокументам = "";
	
	Для Каждого Документ Из МассивДокументов Цикл
	
		ТекстЗапроса = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыДокумента.Ссылка КАК Документы
		|ИЗ
		|	Документ.%1.Товары КАК ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТоварыДокумента.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	НЕ ТоварыДокумента.Ссылка.ПометкаУдаления
		|	И ВЫБОР
		|		КОГДА &ЕстьУпаковка
		|			ТОГДА ТоварыДокумента.Упаковка = &Упаковка
		|		ИНАЧЕ 
		|			ВЫБОР
		|				КОГДА ТоварыДокумента.Упаковка = НЕОПРЕДЕЛЕНО 
		|			        ТОГДА ЛОЖЬ
		|				ИНАЧЕ ТоварыДокумента.Упаковка <> СправочникНоменклатура.ЕдиницаИзмерения
		|			КОНЕЦ
		|	КОНЕЦ", Документ);
	
		ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам +
  						?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам), ОбщегоНазначения.ТекстОбъединитьВсе() + ТекстЗапроса, ТекстЗапроса);
	КонецЦикла;
	
	Возврат ТекстЗапросаПоДокументам;
	
КонецФункции

//Пересчитывает количество в количество упаковок для количества в строке ТЧ
//Параметры:
//			- Количество Тип("Число")
//			- Упаковка Тип("СправочникСсылка.Упаковки") или 
//					   Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//
//Возвращаемое значение: КоличествоУпаковок Тип("Число");
//
Функция КоличествоУпаковок(Количество, Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Упаковка) И ТипЗнч(Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
		Коэффициент = КоэффициентУпаковки(Упаковка);
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	КоличествоУпаковок = Окр(Количество / Коэффициент, 3, РежимОкругления.Окр15как20);
	
	Возврат КоличествоУпаковок;
	
КонецФункции

//Пересчитывает цену за упаковку по цене за базовую единицу
//Параметры:
//			- Цена Тип("Число")
//			- Упаковка Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//			- или Тип("СправочникСсылка.УпаковкиНоменклатуры")
//
//Возвращаемое значение: ЦенаЗаУпаковку Тип("Число")
//
Функция ЦенаЗаУпаковку(Цена, Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Упаковка) И ТипЗнч(Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
		Коэффициент = КоэффициентУпаковки(Упаковка);
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	ЦенаЗаУпаковку = Окр(Цена * Коэффициент, 2, РежимОкругления.Окр15как20);
	
	Возврат ЦенаЗаУпаковку;
	
КонецФункции 



//Пересчитывает количество упаковок в количество в строке ТЧ
//Параметры:
//			- КоличествоУпаковок Тип("Число")
//			- Упаковка Тип("СправочникСсылка.Упаковки") или 
//					   Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//
//Возвращаемое значение: Количество Тип("Число");
//
Функция КоличествоПоКоличествуУпаковок(КоличествоУпаковок, Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Упаковка) И ТипЗнч(Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
		Коэффициент = КоэффициентУпаковки(Упаковка);
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	Количество = Окр(КоличествоУпаковок * Коэффициент, 3, РежимОкругления.Окр15как20);
	
	Возврат Количество;
	
КонецФункции

//Пересчитывает цену за базовую единицу по цене упаковки
//Параметры:
//			- ЦенаЗаУпаковку Тип("Число")
//			- Упаковка Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//			- или Тип("СправочникСсылка.УпаковкиНоменклатуры")
//
//Возвращаемое значение: Цена Тип("Число")
//
Функция ЦенаИзЦеныЗаУпаковку(ЦенаЗаУпаковку, Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Упаковка) И ТипЗнч(Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
		Коэффициент = КоэффициентУпаковки(Упаковка);
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	Цена = Окр(ЦенаЗаУпаковку / Коэффициент, 2, РежимОкругления.Окр15как20);
	
	Возврат Цена;
	
КонецФункции
